----------------------------------------------------------------
-- Узнать информацию о брони
----------------------------------------------------------------
call EMPLOYEE.Get_Booking_Details_By_Id(1);

----------------------------------------------------------------
-- Получить информацию о всех сервисах/об 1
----------------------------------------------------------------
BEGIN
    EMPLOYEE.Get_Service_Info(2);
EXCEPTION
    WHEN VALUE_ERROR THEN
        DBMS_OUTPUT.PUT_LINE('Ошибка преобразования числа в строку.');
    WHEN others THEN
        DBMS_OUTPUT.PUT_LINE('Произошла ошибка: ' || SQLERRM);
END;

----------------------------------------------------------------
-- Просмотреть сервисы для текущего пользователя
----------------------------------------------------------------
call EMPLOYEE.GET_MY_SERVICES();

----------------------------------------------------------------
-- Найти информацио о госте
----------------------------------------------------------------
BEGIN
    EMPLOYEE.FIND_GUEST(2);
EXCEPTION
    WHEN VALUE_ERROR THEN
        DBMS_OUTPUT.PUT_LINE('Ошибка преобразования числа в строку.');
    WHEN others THEN
        DBMS_OUTPUT.PUT_LINE('Произошла ошибка: ' || SQLERRM);
END;

----------------------------------------------------------------
-- Уволиться
----------------------------------------------------------------
call EMPLOYEE.QUIT_JOB();

----------------------------------------------------------------
-- Узнать дни рождения коллег
----------------------------------------------------------------
call EMPLOYEE.Birthday_Report();